# Управляющие конструкции (задания)

## 1. Специальные операторы pass и ...
Задание:
Создайте функцию todo() с pass, а затем замените pass на реальную реализацию
(например, возвращение строки "Готово!").
Аналогично — сделайте класс с методом, где пока стоит ....
## 2. Консольный ввод/вывод
Задание:
Напишите программу, которая спрашивает имя и возраст пользователя, а затем печатает:
Привет, <имя>, через 5 лет тебе будет <возраст+5>.
## 3. Роль отступов
Задание:
Скопируйте код с неправильным отступом и исправьте его.
Например:
if True:
print("Hello")
Сделайте так, чтобы код работал корректно.
## 4. Условный оператор и булева логика
Задание:
Напишите программу, которая принимает число и выводит:
•
"positive" — если больше нуля
•
"zero" — если равно нулю
•
"negative" — если меньше нуля
Дополнительно: реализуйте проверку "делится ли число на 2 и на 3 одновременно" с
помощью and.
## 5. Операции сравнения
Задание:
Напишите программу, которая спрашивает число и проверяет, входит ли оно в диапазон

[10, 20].
Используйте цепочку сравнений (10 <= x <= 20).
Дополнительно: напишите проверку x is None для переменной, в которую может
записаться None.
## 6. match/case
Задание:
Напишите программу, которая принимает от пользователя строку: "start", "stop",
"pause".
Используйте match/case, чтобы напечатать:
•
"Запуск"
•
"Остановка"
•
"Пауза"
•
"Неизвестная команда" (если введено что-то другое).
## 7. Циклы for и while
Задание:
1. Используя for, выведите квадраты чисел от 1 до 5.
2. Используя while, попросите пользователя ввести пароль до тех пор, пока он не
введет "1234".
3. Добавьте else к циклу, чтобы вывести "Успешный вход".
## 8. Исключения
Задание:
Напишите программу, которая делит число 10 на ввод пользователя.
Обработайте случай, если введен 0 или строка вместо числа.
Используйте try/except, а также finally для вывода "Программа завершена".
## 9. Модули и __name__
Задание:
1. Создайте файл mymodule.py с функцией hello(), которая печатает "Hello from
module".
2. В mymodule.py измените код так, чтобы функция печатала сообщение только когда
модуль запускается напрямую.
3. Попробуйте запустить mymodule.py напрямую и импортировать его в другом файле.

4*(Опционально).
- Создать директорию (mypackage) с файлами __init__.py и mymodule.py
- Создать newmodule.py на уровне созданной директории
Должно получиться:
mypackage/
|__ __init__.py
|__ mymodule.py
newmodule.py
Скопировать в mymodule.py:
def add(a, b):
return a + b
Скопировать в newmodule.py:
from mypackage import add
print(add(1, 2))
Не меняя код в newmodule.py нужно исправить ошибку импорта в этом файле.
## 10. Дополнительно
Задания:
1. Используя тернарный оператор, напишите проверку: "even" если число четное,
иначе "odd".
2. Реализуйте проверку строки с моржовым оператором: пусть вводится строка, и
если она число — напечатать "Это число".
